cfd/cases/robot_simple/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// robot_simple：分块思路照搬 DTCHull，尺寸由 setup_robot.sh 生成
scale   1;

vertices
(
    (-0.9400 -0.6200 -0.5080) (0.4200 -0.6200 -0.5080) (0.4200 0 -0.5080) (-0.9400 0 -0.5080)
    (-0.9400 -0.6200 -0.0625) (0.4200 -0.6200 -0.0625) (0.4200 0 -0.0625) (-0.9400 0 -0.0625)
    (-0.9400 -0.6200 0.0102) (0.4200 -0.6200 0.0102) (0.4200 0 0.0102) (-0.9400 0 0.0102)
    (-0.9400 -0.6200 0.012) (0.4200 -0.6200 0.012) (0.4200 0 0.012) (-0.9400 0 0.012)
    (-0.9400 -0.6200 0.0138) (0.4200 -0.6200 0.0138) (0.4200 0 0.0138) (-0.9400 0 0.0138)
    (-0.9400 -0.6200 0.0600) (0.4200 -0.6200 0.0600) (0.4200 0 0.0600) (-0.9400 0 0.0600)
    (-0.9400 -0.6200 0.1420) (0.4200 -0.6200 0.1420) (0.4200 0 0.1420) (-0.9400 0 0.1420)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)         (21 10 25) simpleGrading (1 1 0.05)
    hex (4 5 6 7 8 9 10 11)       (21 10 25) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15)   (21 10 4)    simpleGrading (1 1 1)
    hex (12 13 14 15 16 17 18 19) (21 10 4)    simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (21 10 20) simpleGrading (1 1 1)
    hex (20 21 22 23 24 25 26 27) (21 10 10) simpleGrading (1 1 5)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces ( (24 25 26 27) );
    }
    inlet
    {
        type patch;
        faces ( (1 2 6 5) (5 6 10 9) (9 10 14 13) (13 14 18 17) (17 18 22 21) (21 22 26 25) );
    }
    outlet
    {
        type patch;
        faces ( (0 4 7 3) (4 8 11 7) (8 12 15 11) (12 16 19 15) (16 20 23 19) (20 24 27 23) );
    }
    bottom
    {
        type symmetryPlane;
        faces ( (0 3 2 1) );
    }
    side
    {
        type symmetryPlane;
        faces ( (0 1 5 4) (4 5 9 8) (8 9 13 12) (12 13 17 16) (16 17 21 20) (20 21 25 24) );
    }
    midPlane
    {
        type symmetryPlane;
        faces ( (3 7 6 2) (7 11 10 6) (11 15 14 10) (15 19 18 14) (19 23 22 18) (23 27 26 22) );
    }
);

mergePatchPairs
(
);
