cfd/cases/robot_simple/system/topoSetDict.1
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 1 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.4200 -0.2450 -0.1325) (0.2200 0 0.1400);
    }
);
