cfd/cases/robot_simple/system/topoSetDict.2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 2 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.2600 -0.1450 -0.0825) (0.1600 0 0.0900);
    }
);
