cfd/cases/robot_simple/system/topoSetDict.3
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 3 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.1900 -0.1050 -0.0625) (0.1400 0 0.0700);
    }
);
