cfd/cases/robot_simple/system/topoSetDict.4
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 4 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.1500 -0.0800 -0.0525) (0.1250 0 0.0600);
    }
);
