cfd/cases/robot_simple/system/topoSetDict.5
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 5 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.1300 -0.0650 -0.0445) (0.1150 0 0.0520);
    }
);
