cfd/cases/robot_simple/system/topoSetDict.6
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 6 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.1160 -0.0570 -0.0395) (0.1080 0 0.0470);
    }
);
